---
title: GlobalParameterFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GlobalParameterFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# GlobalParameterFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ElementPropLinkCircularChain { get; }` | `GlobalParameterFailures.ElementPropLinkCircularChain` | FailureDefinitionId |
| `FailureDefinitionId ElementPropLinkCircularChainError { get; }` | `GlobalParameterFailures.ElementPropLinkCircularChainError` | FailureDefinitionId |
| `FailureDefinitionId GlobalParamFormulaCircularChain { get; }` | `GlobalParameterFailures.GlobalParamFormulaCircularChain` | FailureDefinitionId |
| `FailureDefinitionId GlobalParamFormulaCircularChainError { get; }` | `GlobalParameterFailures.GlobalParamFormulaCircularChainError` | FailureDefinitionId |
| `FailureDefinitionId GlobalParamInvalidElemParamValue { get; }` | `GlobalParameterFailures.GlobalParamInvalidElemParamValue` | FailureDefinitionId |
| `FailureDefinitionId InvalidElementPropToGlobalParamLink { get; }` | `GlobalParameterFailures.InvalidElementPropToGlobalParamLink` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```